FORMAT_URL_ERROR = 'Ссылка не соответствует формату.'
RESPONSE_ERROR = 'Ссылка не действительна.'

MESSAGE_START_DOWNLOAD = 'Отправка ссылок на обработку.'
MESSAGE_URL_DOWNLOAD = (
    'Файл по данному url был скачен ранее и находится по адресу:'
)
MESSAGE_WAITING = (
    'Для добавления новых ссылок на скачивание, дождитесь окончания загрузки.'
)

KEY_URL_ERROR = 'Данная ссылка не предназначена для скачивания файла.'

SERVER_COMMAND_ERROR = 'Команда не найдена.'

EMPTY_LIST = 'Не добавленно не одной ссылки для скачивания'